
## Terraform Plan 📖
<details>
<summary>Click to expand</summary>

```HCL

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.master_nodes[0].proxmox_vm_qemu.vm has been deleted
  - resource "proxmox_vm_qemu" "vm" {
      - default_ipv4_address   = "10.9.9.172" -> null
        id                     = "pve/qemu/100"
        name                   = "kube-master-01"
        tags                   = "k3s;master"
        # (52 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.worker_nodes[0].proxmox_vm_qemu.vm has been deleted
  - resource "proxmox_vm_qemu" "vm" {
      - default_ipv4_address   = "10.9.9.169" -> null
        id                     = "pve/qemu/101"
        name                   = "kube-worker-01"
        tags                   = "k3s;worker"
        # (52 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.worker_nodes[1].proxmox_vm_qemu.vm has been deleted
  - resource "proxmox_vm_qemu" "vm" {
      - default_ipv4_address   = "10.9.9.171" -> null
        id                     = "pve/qemu/102"
        name                   = "kube-worker-02"
        tags                   = "k3s;worker"
        # (52 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.master_nodes[0].proxmox_vm_qemu.vm will be created
  + resource "proxmox_vm_qemu" "vm" {
      + additional_wait        = 5
      + agent                  = 1
      + agent_timeout          = 90
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=virtio0"
      + bootdisk               = (known after apply)
      + ciupgrade              = false
      + ciuser                 = "debian"
      + clone                  = "packer-debian-12.11.0-20250606164437"
      + clone_wait             = 10
      + current_node           = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "Managed by Terraform."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=dhcp,ip6=dhcp"
      + ipconfig1              = "ip=dhcp,ip6=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 2048
      + name                   = "kube-master-01"
      + onboot                 = true
      + os_type                = "cloud-init"
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-pci"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + sshkeys                = (sensitive value)
      + tablet                 = true
      + tags                   = "k3s,master"
      + target_node            = "pve"
      + unused_disk            = (known after apply)
      + vm_state               = "running"
      + vmid                   = (known after apply)

      + cpu {
          + cores   = 1
          + limit   = 0
          + numa    = false
          + sockets = 1
          + type    = "host"
          + units   = 0
          + vcores  = 0
        }

      + disks {
          + ide {
              + ide2 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "32G"
                      + storage              = "vmpool"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }
      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 1
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + smbios (known after apply)
    }

  # module.worker_nodes[0].proxmox_vm_qemu.vm will be created
  + resource "proxmox_vm_qemu" "vm" {
      + additional_wait        = 5
      + agent                  = 1
      + agent_timeout          = 90
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=virtio0"
      + bootdisk               = (known after apply)
      + ciupgrade              = false
      + ciuser                 = "debian"
      + clone                  = "packer-debian-12.11.0-20250606164437"
      + clone_wait             = 10
      + current_node           = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "Managed by Terraform."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=dhcp,ip6=dhcp"
      + ipconfig1              = "ip=dhcp,ip6=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 32768
      + name                   = "kube-worker-01"
      + onboot                 = true
      + os_type                = "cloud-init"
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-pci"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + sshkeys                = (sensitive value)
      + tablet                 = true
      + tags                   = "k3s,worker"
      + target_node            = "pve"
      + unused_disk            = (known after apply)
      + vm_state               = "running"
      + vmid                   = (known after apply)

      + cpu {
          + cores   = 6
          + limit   = 0
          + numa    = false
          + sockets = 1
          + type    = "host"
          + units   = 0
          + vcores  = 0
        }

      + disks {
          + ide {
              + ide2 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "32G"
                      + storage              = "vmpool"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }
      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 1
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + smbios (known after apply)
    }

  # module.worker_nodes[1].proxmox_vm_qemu.vm will be created
  + resource "proxmox_vm_qemu" "vm" {
      + additional_wait        = 5
      + agent                  = 1
      + agent_timeout          = 90
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=virtio0"
      + bootdisk               = (known after apply)
      + ciupgrade              = false
      + ciuser                 = "debian"
      + clone                  = "packer-debian-12.11.0-20250606164437"
      + clone_wait             = 10
      + current_node           = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "Managed by Terraform."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=dhcp,ip6=dhcp"
      + ipconfig1              = "ip=dhcp,ip6=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 32768
      + name                   = "kube-worker-02"
      + onboot                 = true
      + os_type                = "cloud-init"
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-pci"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + sshkeys                = (sensitive value)
      + tablet                 = true
      + tags                   = "k3s,worker"
      + target_node            = "pve"
      + unused_disk            = (known after apply)
      + vm_state               = "running"
      + vmid                   = (known after apply)

      + cpu {
          + cores   = 6
          + limit   = 0
          + numa    = false
          + sockets = 1
          + type    = "host"
          + units   = 0
          + vcores  = 0
        }

      + disks {
          + ide {
              + ide2 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "32G"
                      + storage              = "vmpool"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }
      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 1
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + smbios (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ master_default_ipv4_addresses = [
      ~ "10.9.9.172" -> (known after apply),
    ]
  ~ worker_default_ipv4_addresses = [
      ~ "10.9.9.169" -> (known after apply),
      ~ "10.9.9.171" -> (known after apply),
    ]
```

</details>

*Pusher: @MrStarktastic, Action: `pull_request`*